<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"38c8229bdd07e164bc623eee9cea0ec843c96e93a10dcddb0c1e1096cf06474f","plan_job_ref":"Job Test Reusable Workflows #40 at https://github.com/tx-pts-dai/github-workflows/actions/runs/7193205101","plan_hash":"426e283e7ce3343720dc986941ed354dcf0989ce825d7311692645ff7fd74224","plan_text_format":"text","version":"1.38.0"} -->
Terraform plan in __tests/terraform__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.this will be created
  + resource "random_id" "this" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_pet.this will be created
  + resource "random_pet" "this" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + random_id  = (known after apply)
  + random_pet = (known after apply)
```
</details>

:memo: Plan generated in [Test Reusable Workflows #40](https://github.com/tx-pts-dai/github-workflows/actions/runs/7193205101)